print("Привет, и добропожаловать!")
print("Инструкция: Напиши КРИНЖ, ЛОЛ, ЩИЩ или ТРЭШ")
meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное"
            "ЩИЩ": "Шутка"
            "ТРЭШ": "Что-то абсурдное или нелепое"
            }
for _ in range(5):
    word = input("Введите непонятное слово (большими буквами!): ").upper()
    if word in meme_dict.keys():
         # Что делать, если слово нашлось?
        print(meme_dict[word])
    else:
         # Что делать, если слово не нашлось?
        print("Такого слова еще нет в словаре")
